Homework 1:

import pandas as pd

data = {'First Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, 30, 35, 40],
        'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']}
df = pd.DataFrame(data)

1. Rename column names using function. "First Name" --> "first_name", "Age" --> "age

In [5]:
import pandas as pd

data = {'First Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, 30, 35, 40],
        'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']}
df = pd.DataFrame(data)
df = df.rename(columns = {'First Name': 'first_name', 'Age': 'age'})
df

  first_name  age           City
0      Alice   25       New York
1        Bob   30  San Francisco
2    Charlie   35    Los Angeles
3      David   40        Chicago

2. Print the first 3 rows of the DataFrame

In [6]:
df.head(3)

  first_name  age           City
0      Alice   25       New York
1        Bob   30  San Francisco
2    Charlie   35    Los Angeles

3. Find the mean age of the individuals

In [7]:
mean_age = df['age'].mean()
print(mean_age)

32.5

4. Select and print only the 'Name' and 'City' columns

In [8]:
print(df[['first_name', 'City']])

  first_name           City
0      Alice       New York
1        Bob  San Francisco
2    Charlie    Los Angeles
3      David        Chicago

5. Add a new column 'Salary' with random salary values

In [9]:
import numpy as np
df['Salary'] = np.random.randint(1000,10000, size=len(df))
print(df)

  first_name  age           City  Salary
0      Alice   25       New York    1562
1        Bob   30  San Francisco    5130
2    Charlie   35    Los Angeles    4008
3      David   40        Chicago    1198

6. Display summary statistics of the DataFrame

In [10]:
print(df.describe())

             age       Salary
count   4.000000     4.000000
mean   32.500000  2974.500000
std     6.454972  1903.103693
min    25.000000  1198.000000
25%    28.750000  1471.000000
50%    32.500000  2785.000000
75%    36.250000  4288.500000
max    40.000000  5130.000000

Homework 2:

1. Create a DataFrame named sales_and_expenses with columns 'Month', 'Sales', and 'Expenses', representing monthly sales and expenses data.
Use below table.

| Month | Sales | Expenses |
|-------|-------|----------|
| Jan   | 5000  | 3000     |
| Feb   | 6000  | 3500     |
| Mar   | 7500  | 4000     |
| Apr   | 8000  | 4500     |

In [11]:
import pandas as pd
sales_expenses = pd.DataFrame({
    'Month' : ['Jan', 'Feb', 'Mar', 'Apr'],
    'Sales' : [5000, 6000, 7500, 8000],
    'Expenses' : [3000, 3500, 4000, 4500]
})
print(sales_expenses)

  Month  Sales  Expenses
0   Jan   5000      3000
1   Feb   6000      3500
2   Mar   7500      4000
3   Apr   8000      4500

2. Calculate and display the maximum sales and expenses.

In [23]:
max_sales = sales_expenses['Sales'].max()
print(max_sales)
max_expenses = sales_expenses['Expenses'].max()
print(max_expenses)

8000
4500

3. Calculate and display the minimum sales and expenses.

In [24]:
min_sales = sales_expenses['Sales'].min()
print(min_sales)
min_expenses = sales_expenses['Expenses'].min()
print(min_expenses)

5000
3000

4. Calculate and display the average sales and expenses.

In [25]:
mean_sales = sales_expenses['Sales'].mean()
print(mean_sales)
mean_expenses = sales_expenses['Expenses'].mean()
print(mean_expenses)

6625.0
3750.0

Homework 3:

1. Create a DataFrame named expenses with columns 'Category', 'January', 'February', 'March', and 'April', representing monthly expenses for different categories. Use below table.

| Category       | January | February | March | April |
|----------------|---------|----------|-------|-------|
| Rent           | 1200    | 1300     | 1400  | 1500  |
| Utilities      | 200     | 220      | 240   | 250   |
| Groceries      | 300     | 320      | 330   | 350   |
| Entertainment  | 150     | 160      | 170   | 180   |

In [17]:
import pandas as pd
expenses = pd.DataFrame({
    'January' : [1200, 200, 300, 150],
    'February' : [1300, 220, 320, 160],
    'March' : [1400, 240, 330, 170],
    'April' : [1500, 250, 350, 180]
}, index= ['Rent', 'Utilities', 'Groceries', 'Entertainment'])
##expenses = expenses.set_index('Category')
print(expenses)

               January  February  March  April
Rent              1200      1300   1400   1500
Utilities          200       220    240    250
Groceries          300       320    330    350
Entertainment      150       160    170    180

2. Calculate and display the maximum expense for each category.

In [10]:
max_expenses = expenses.max(axis=1)
print(max_expenses)

Rent             1500
Utilities         250
Groceries         350
Entertainment     180
dtype: int64

3. Calculate and display the minimum expense for each category.

In [11]:
min_expenses = expenses.min(axis=1)
print(min_expenses)

Rent             1200
Utilities         200
Groceries         300
Entertainment     150
dtype: int64

4. Calculate and display the average expense for each category.

In [13]:
avarage_expenses = expenses.mean(axis=1)
print(avarage_expenses)

Rent             1350.0
Utilities         227.5
Groceries         325.0
Entertainment     165.0
dtype: float64